fiskebolle30/Bachelor_STM32_code/Audiograb/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

#include "stm32h7xx_ll_rcc.h"
#include "stm32h7xx_ll_spi.h"
#include "stm32h7xx_ll_bus.h"
#include "stm32h7xx_ll_cortex.h"
#include "stm32h7xx_ll_system.h"
#include "stm32h7xx_ll_utils.h"
#include "stm32h7xx_ll_pwr.h"
#include "stm32h7xx_ll_gpio.h"
#include "stm32h7xx_ll_dma.h"

#include "stm32h7xx_ll_exti.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define HSE24_EN_Pin GPIO_PIN_10
#define HSE24_EN_GPIO_Port GPIOF
#define V_IN_MEAS_Pin GPIO_PIN_4
#define V_IN_MEAS_GPIO_Port GPIOC
#define V_IMON_Pin GPIO_PIN_5
#define V_IMON_GPIO_Port GPIOC
#define SPI1_NSS_Pin GPIO_PIN_7
#define SPI1_NSS_GPIO_Port GPIOE
#define RPI_CM_ENABLE_Pin GPIO_PIN_9
#define RPI_CM_ENABLE_GPIO_Port GPIOE
#define RPI_GLOBAL_EN_Pin GPIO_PIN_11
#define RPI_GLOBAL_EN_GPIO_Port GPIOE
#define RPI_RUN_PG_Pin GPIO_PIN_13
#define RPI_RUN_PG_GPIO_Port GPIOE
#define USB_RESET_Pin GPIO_PIN_14
#define USB_RESET_GPIO_Port GPIOD
#define SD_DETECT_Pin GPIO_PIN_6
#define SD_DETECT_GPIO_Port GPIOC

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
